Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_otg1_hs_device.h
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL                (0x3u<<24)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PERSCHIVL_0              (0x1u<<24)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PFIVL                    (0x3u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_PFIVL_0                  (0x1u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_DAD                      (0x7Fu<<4)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_DAD_0                    (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_NZLSOHSK                 (0x1u<<2)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_DSPD                     (0x3u<<0)
#define OTG1_HS_DEVICE_OTG_HS_DCFG_DSPD_0                   (0x1u<<0)

// OTG_HS_DCTL Configuration

#define OTG1_HS_DEVICE_OTG_HS_DCTL_POPRGDNE                 (0x1u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_CGONAK                   (0x1u<<10)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SGONAK                   (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_CGINAK                   (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SGINAK                   (0x1u<<7)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_TCTL                     (0x7u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_TCTL_0                   (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_GONSTS                   (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_GINSTS                   (0x1u<<2)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_SDIS                     (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DCTL_RWUSIG                   (0x1u<<0)

// OTG_HS_DSTS Configuration

#define OTG1_HS_DEVICE_OTG_HS_DSTS_FNSOF                    (0x3FFFu<<8)
#define OTG1_HS_DEVICE_OTG_HS_DSTS_FNSOF_0                  (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DSTS_EERR                     (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DSTS_ENUMSPD                  (0x3u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DSTS_ENUMSPD_0                (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DSTS_SUSPSTS                  (0x1u<<0)

// OTG_HS_DIEPMSK Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_BIM                   (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_TXFURM                (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_INEPNEM               (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_INEPNMM               (0x1u<<5)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_ITTXFEMSK             (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_TOM                   (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_EPDM                  (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPMSK_XFRCM                 (0x1u<<0)

// OTG_HS_DOEPMSK Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_BOIM                  (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_OPEM                  (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_B2BSTUP               (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_OTEPDM                (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_STUPM                 (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_EPDM                  (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPMSK_XFRCM                 (0x1u<<0)

// OTG_HS_DAINT Configuration

#define OTG1_HS_DEVICE_OTG_HS_DAINT_OEPINT                  (0xFFFFu<<16)
#define OTG1_HS_DEVICE_OTG_HS_DAINT_OEPINT_0                (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DAINT_IEPINT                  (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DAINT_IEPINT_0                (0x1u<<0)

// OTG_HS_DAINTMSK Configuration

#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_OEPM                 (0xFFFFu<<16)
#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_OEPM_0               (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_IEPM                 (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DAINTMSK_IEPM_0               (0x1u<<0)

// OTG_HS_DVBUSDIS Configuration

#define OTG1_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT               (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DVBUSDIS_VBUSDT_0             (0x1u<<0)

// OTG_HS_DVBUSPULSE Configuration

#define OTG1_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP             (0xFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DVBUSPULSE_DVBUSP_0           (0x1u<<0)

// OTG_HS_DTHRCTL Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_ARPEN                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN              (0x1FFu<<17)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_RXTHRLEN_0            (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_RXTHREN               (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN              (0x1FFu<<2)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN_0            (0x1u<<2)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN              (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN           (0x1u<<0)

// OTG_HS_DIEPEMPMSK Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM          (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM_0        (0x1u<<0)

// OTG_HS_DEACHINT Configuration

#define OTG1_HS_DEVICE_OTG_HS_DEACHINT_OEP1INT              (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DEACHINT_IEP1INT              (0x1u<<1)

// OTG_HS_DEACHINTMSK Configuration

#define OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM          (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM          (0x1u<<1)

// OTG_HS_DIEPCTL0 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM               (0xFu<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM_0             (0x1u<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ_0              (0x1u<<0)

