Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_otg1_hs_device.h
// OTG_HS_DIEPINT0 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_NAK                  (0x1u<<13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BERR                 (0x1u<<12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_PKTDRPSTS            (0x1u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_BNA                  (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_TXFIFOUDRN           (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_TXFE                 (0x1u<<7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_INEPNE               (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_ITTXFE               (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_TOC                  (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT0_XFRC                 (0x1u<<0)

// OTG_HS_DIEPTSIZ0 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT              (0x3u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ              (0x7Fu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DIEPDMA1 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR              (0xFFFFFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR_0            (0x1u<<0)

// OTG_HS_DTXFSTS0 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS0_INEPTFSAV            (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS0_INEPTFSAV_0          (0x1u<<0)

// OTG_HS_DIEPCTL1 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM               (0xFu<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM_0             (0x1u<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ_0              (0x1u<<0)

// OTG_HS_DIEPINT1 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_NAK                  (0x1u<<13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BERR                 (0x1u<<12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_PKTDRPSTS            (0x1u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_BNA                  (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_TXFIFOUDRN           (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_TXFE                 (0x1u<<7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_INEPNE               (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_ITTXFE               (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_TOC                  (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT1_XFRC                 (0x1u<<0)

// OTG_HS_DIEPTSIZ1 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_MCNT                (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_MCNT_0              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ1_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DIEPDMA2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA2_DMAADDR              (0xFFFFFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA2_DMAADDR_0            (0x1u<<0)

// OTG_HS_DTXFSTS1 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS1_INEPTFSAV            (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS1_INEPTFSAV_0          (0x1u<<0)

// OTG_HS_DIEPCTL2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_TXFNUM               (0xFu<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_TXFNUM_0             (0x1u<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL2_MPSIZ_0              (0x1u<<0)

// OTG_HS_DIEPINT2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_NAK                  (0x1u<<13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_BERR                 (0x1u<<12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_PKTDRPSTS            (0x1u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_BNA                  (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_TXFIFOUDRN           (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_TXFE                 (0x1u<<7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_INEPNE               (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_ITTXFE               (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_TOC                  (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT2_XFRC                 (0x1u<<0)

