Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_otg1_hs_device.h
// OTG_HS_DIEPTSIZ2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_MCNT                (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_MCNT_0              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ2_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DIEPDMA3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA3_DMAADDR              (0xFFFFFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA3_DMAADDR_0            (0x1u<<0)

// OTG_HS_DTXFSTS2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS2_INEPTFSAV            (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS2_INEPTFSAV_0          (0x1u<<0)

// OTG_HS_DIEPCTL3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_TXFNUM               (0xFu<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_TXFNUM_0             (0x1u<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL3_MPSIZ_0              (0x1u<<0)

// OTG_HS_DIEPINT3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_NAK                  (0x1u<<13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_BERR                 (0x1u<<12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_PKTDRPSTS            (0x1u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_BNA                  (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_TXFIFOUDRN           (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_TXFE                 (0x1u<<7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_INEPNE               (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_ITTXFE               (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_TOC                  (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT3_XFRC                 (0x1u<<0)

// OTG_HS_DIEPTSIZ3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_MCNT                (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_MCNT_0              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ3_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DIEPDMA4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR              (0xFFFFFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR_0            (0x1u<<0)

// OTG_HS_DTXFSTS3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS3_INEPTFSAV            (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS3_INEPTFSAV_0          (0x1u<<0)

// OTG_HS_DIEPCTL4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM               (0xFu<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM_0             (0x1u<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ_0              (0x1u<<0)

// OTG_HS_DIEPINT4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_NAK                  (0x1u<<13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_BERR                 (0x1u<<12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_PKTDRPSTS            (0x1u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_BNA                  (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TXFIFOUDRN           (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TXFE                 (0x1u<<7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_INEPNE               (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_ITTXFE               (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_TOC                  (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT4_XFRC                 (0x1u<<0)

// OTG_HS_DIEPTSIZ4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT                (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT_0              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ_0            (0x1u<<0)

