Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_otg1_hs_device.h
// OTG_HS_DIEPDMA5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA5_DMAADDR              (0xFFFFFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPDMA5_DMAADDR_0            (0x1u<<0)

// OTG_HS_DTXFSTS4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV            (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV_0          (0x1u<<0)

// OTG_HS_DIEPCTL5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM               (0xFu<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM_0             (0x1u<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_0              (0x1u<<0)

// OTG_HS_DIEPTSIZ6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_MCNT                (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_MCNT_0              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ6_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DTXFSTS6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS6_INEPTFSAV            (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS6_INEPTFSAV_0          (0x1u<<0)

// OTG_HS_DIEPINT5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_NAK                  (0x1u<<13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_BERR                 (0x1u<<12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS            (0x1u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_BNA                  (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN           (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TXFE                 (0x1u<<7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE               (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE               (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_TOC                  (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT5_XFRC                 (0x1u<<0)

// OTG_HS_DIEPTSIZ7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT                (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT_0              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DTXFSTS7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV            (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV_0          (0x1u<<0)

// OTG_HS_DIEPTSIZ5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT                (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_0              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DTXFSTS5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV            (0xFFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV_0          (0x1u<<0)

// OTG_HS_DIEPCTL6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM               (0xFu<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM_0             (0x1u<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ_0              (0x1u<<0)

// OTG_HS_DIEPINT6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_NAK                  (0x1u<<13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_BERR                 (0x1u<<12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_PKTDRPSTS            (0x1u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_BNA                  (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TXFIFOUDRN           (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TXFE                 (0x1u<<7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_INEPNE               (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_ITTXFE               (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_TOC                  (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT6_XFRC                 (0x1u<<0)

