Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_otg1_hs_device.h
// OTG_HS_DIEPCTL7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM               (0xFu<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM_0             (0x1u<<22)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ_0              (0x1u<<0)

// OTG_HS_DIEPINT7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_NAK                  (0x1u<<13)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_BERR                 (0x1u<<12)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS            (0x1u<<11)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_BNA                  (0x1u<<9)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN           (0x1u<<8)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TXFE                 (0x1u<<7)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE               (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE               (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_TOC                  (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DIEPINT7_XFRC                 (0x1u<<0)

// OTG_HS_DOEPCTL0 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM                 (0x1u<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ                (0x3u<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_0              (0x1u<<0)

// OTG_HS_DOEPINT0 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_NYET                 (0x1u<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP              (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS              (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_STUP                 (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT0_XFRC                 (0x1u<<0)

// OTG_HS_DOEPTSIZ0 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT             (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_STUPCNT_0           (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_PKTCNT              (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ              (0x7Fu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ0_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DOEPCTL1 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_SNPM                 (0x1u<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL1_MPSIZ_0              (0x1u<<0)

// OTG_HS_DOEPINT1 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_NYET                 (0x1u<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_B2BSTUP              (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_OTEPDIS              (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_STUP                 (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT1_XFRC                 (0x1u<<0)

// OTG_HS_DOEPTSIZ1 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT      (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_RXDPID_STUPCNT_0    (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ1_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DOEPCTL2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_SNPM                 (0x1u<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL2_MPSIZ_0              (0x1u<<0)

// OTG_HS_DOEPINT2 Configuration

