Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_otg1_hs_device.h
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_NYET                 (0x1u<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_B2BSTUP              (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_OTEPDIS              (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_STUP                 (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT2_XFRC                 (0x1u<<0)

// OTG_HS_DOEPTSIZ2 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT      (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_RXDPID_STUPCNT_0    (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ2_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DOEPCTL3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_SNPM                 (0x1u<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL3_MPSIZ_0              (0x1u<<0)

// OTG_HS_DOEPINT3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_NYET                 (0x1u<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_B2BSTUP              (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_OTEPDIS              (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_STUP                 (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT3_XFRC                 (0x1u<<0)

// OTG_HS_DOEPTSIZ3 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT      (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_0    (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DOEPCTL4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_SNPM                 (0x1u<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL4_MPSIZ_0              (0x1u<<0)

// OTG_HS_DOEPINT4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_NYET                 (0x1u<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP              (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS              (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_STUP                 (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT4_XFRC                 (0x1u<<0)

// OTG_HS_DOEPTSIZ4 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT      (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_0    (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DOEPCTL5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_SNPM                 (0x1u<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL5_MPSIZ_0              (0x1u<<0)

// OTG_HS_DOEPINT5 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_NYET                 (0x1u<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP              (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS              (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_STUP                 (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT5_XFRC                 (0x1u<<0)

// OTG_HS_DOEPTSIZ5 Configuration

