Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_otg1_hs_device.h
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT      (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_RXDPID_STUPCNT_0    (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ5_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DOEPCTL6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_SNPM                 (0x1u<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL6_MPSIZ_0              (0x1u<<0)

// OTG_HS_DOEPINT6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_NYET                 (0x1u<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP              (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS              (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_STUP                 (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT6_XFRC                 (0x1u<<0)

// OTG_HS_DOEPTSIZ6 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT      (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_RXDPID_STUPCNT_0    (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ6_XFRSIZ_0            (0x1u<<0)

// OTG_HS_DOEPCTL7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPENA                (0x1u<<31)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPDIS                (0x1u<<30)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SODDFRM              (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SD0PID_SEVNFRM       (0x1u<<28)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SNAK                 (0x1u<<27)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_CNAK                 (0x1u<<26)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_STALL                (0x1u<<21)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_SNPM                 (0x1u<<20)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP                (0x3u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EPTYP_0              (0x1u<<18)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_NAKSTS               (0x1u<<17)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_EONUM_DPID           (0x1u<<16)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_USBAEP               (0x1u<<15)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ                (0x7FFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPCTL7_MPSIZ_0              (0x1u<<0)

// OTG_HS_DOEPINT7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_NYET                 (0x1u<<14)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP              (0x1u<<6)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS              (0x1u<<4)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_STUP                 (0x1u<<3)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD               (0x1u<<1)
#define OTG1_HS_DEVICE_OTG_HS_DOEPINT7_XFRC                 (0x1u<<0)

// OTG_HS_DOEPTSIZ7 Configuration

#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT      (0x3u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_RXDPID_STUPCNT_0    (0x1u<<29)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT              (0x3FFu<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_PKTCNT_0            (0x1u<<19)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ              (0x7FFFFu<<0)
#define OTG1_HS_DEVICE_OTG_HS_DOEPTSIZ7_XFRSIZ_0            (0x1u<<0)
